{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\mkhatun\Dropbox (UNC Charlotte)\UI-Equity Indicators\Analysis\psam_p37_2019.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Feb 2022, 12:23:58
{txt}
{com}. 
. di " Setting Survey Weights"
{res} Setting Survey Weights
{txt}
{com}. 
. svyset [pw=pwgtp], sdr(pwgtp1 - pwgtp80) vce(sdr) mse

{txt}Sampling weights:{col 19}{res}pwgtp
             {txt}VCE:{col 19}{res}sdr
             {txt}MSE:{col 19}{res}on
{p2colset 1 19 19 2}{...}
{txt}{p2col:{space 5}SDR weights:}{res}pwgtp1 .. pwgtp80{p_end}
{p2colreset}{...}
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}<one>
 Sampling unit 1:{col 19}<observations>
           FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
. local meck "puma == 3101 | puma == 3102 | puma == 3103 | puma == 3104 | puma == 3105 | puma == 3106 | puma == 3107 | puma == 3108"
{txt}
{com}. 
. di "Indicator Variable for Charlotte-Mecklenburg using PUMA codes"
{res}Indicator Variable for Charlotte-Mecklenburg using PUMA codes
{txt}
{com}. 
. gen charmeck = 0
{txt}
{com}. 
. replace charmeck = 1 if `meck'
{txt}(9,958 real changes made)

{com}. 
. 
. di "Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion"
{res}Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion
{txt}
{com}. 
. di "White"
{res}White
{txt}
{com}. 
. svy sdr, subpop(if rac1p ==1 & charmeck == 1 & agep >=25 & agep <64 & esr !=4 & esr !=5) mse : tabulate esr, cell se ci deff
{res}{txt}(running {bf:tabulate} on estimation sample)
{res}
{txt}{col 51}{lalign 15:Number of obs}{col 66} = {res}{ralign 10:103,516}
{txt}{col 51}{lalign 15:Population size}{col 66} = {res}{ralign 10:10,488,084}
{txt}{col 51}{lalign 15:Subpop. no. obs}{col 66} = {res}{ralign 10:3,408}
{txt}{col 51}{lalign 15:Subpop. size}{col 66} = {res}{ralign 10:326,027}
{txt}{col 51}{lalign 15:Replications}{col 66} = {res}{ralign 10:80}

{txt}{hline 10}{c TT}{hline 59}
      ESR {c |} proportion          se          lb          ub        deff
{hline 10}{c +}{hline 59}
        1 {c |}      {res}.8123       .0093       .7935       .8298       1.813
        {txt}2 {c |}      {res}.0105       .0026       .0064       .0171       2.114
        {txt}3 {c |}      {res}.0225       .0034       .0168       .0301       1.659
        {txt}4 {c |}          {res}0           0                                    
        {txt}5 {c |}          {res}0           0                                    
        {txt}6 {c |}      {res}.1547       .0083       .1391       .1716       1.689
          {txt}{c |} 
    Total {c |}          {res}1                                                
{txt}{hline 10}{c BT}{hline 59}
Key: {col 1}proportion = {res}Cell proportion
{col 6}        {txt}se = {res}Sdr standard error of cell proportion
{col 6}        {txt}lb = {res}Lower 95% confidence bound for cell proportion
{col 6}        {txt}ub = {res}Upper 95% confidence bound for cell proportion
{col 6}      {txt}deff = {res}DEFF for variance of cell proportion

{txt}  Table contains a zero in the marginals.
  Statistics cannot be computed.
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. di "Black "
{res}Black 
{txt}
{com}. 
. svy sdr, subpop(if rac1p ==2 & charmeck == 1 & agep >=25 & agep <64 & esr !=4 & esr !=5) mse : tabulate esr, cell se ci deff
{res}{txt}(running {bf:tabulate} on estimation sample)
{res}
{txt}{col 51}{lalign 15:Number of obs}{col 66} = {res}{ralign 10:103,516}
{txt}{col 51}{lalign 15:Population size}{col 66} = {res}{ralign 10:10,488,084}
{txt}{col 51}{lalign 15:Subpop. no. obs}{col 66} = {res}{ralign 10:1,358}
{txt}{col 51}{lalign 15:Subpop. size}{col 66} = {res}{ralign 10:195,611}
{txt}{col 51}{lalign 15:Replications}{col 66} = {res}{ralign 10:80}

{txt}{hline 10}{c TT}{hline 59}
      ESR {c |} proportion          se          lb          ub        deff
{hline 10}{c +}{hline 59}
        1 {c |}      {res}.8023        .011       .7798        .823       1.483
        {txt}2 {c |}      {res}.0218       .0063       .0123       .0382       3.578
        {txt}3 {c |}      {res}.0287       .0055       .0197       .0417       2.078
        {txt}4 {c |}          {res}0           0                                    
        {txt}5 {c |}          {res}0           0                                    
        {txt}6 {c |}      {res}.1472       .0105       .1277        .169         1.7
          {txt}{c |} 
    Total {c |}          {res}1                                                
{txt}{hline 10}{c BT}{hline 59}
Key: {col 1}proportion = {res}Cell proportion
{col 6}        {txt}se = {res}Sdr standard error of cell proportion
{col 6}        {txt}lb = {res}Lower 95% confidence bound for cell proportion
{col 6}        {txt}ub = {res}Upper 95% confidence bound for cell proportion
{col 6}      {txt}deff = {res}DEFF for variance of cell proportion

{txt}  Table contains a zero in the marginals.
  Statistics cannot be computed.
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. cd "C:\Users\mkhatun\Dropbox (UNC Charlotte)\UI-Equity Indicators\Analysis"
{res}C:\Users\mkhatun\Dropbox (UNC Charlotte)\UI-Equity Indicators\Analysis
{txt}
{com}. 
. di "Load NC ACS PUMS Person file for the year"
{res}Load NC ACS PUMS Person file for the year
{txt}
{com}. 
. import delimited "C:\Users\mkhatun\Dropbox (UNC Charlotte)\UI-Equity Indicators\Data\psam_p37_2019.csv", clear
{res}{txt}(encoding automatically selected: UTF-8)
{text}(288 vars, 103,516 obs)

{com}. 
. di "Start the log"
{res}Start the log
{txt}
{com}. 
. log using psam_p37_2019
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. di "Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion"
{res}Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion
{txt}
{com}. 
. di "White"
{res}White
{txt}
{com}. 
. svy sdr, subpop(if rac1p ==1 & charmeck == 1 & agep >=25 & agep <64 & esr !=4 & esr !=5) mse : tabulate esr, cell se ci deff
{res}{err}data not set up for svy, use {help svyset##|_new:svyset}
{txt}{search r(119), local:r(119);}

end of do-file

{search r(119), local:r(119);}

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. svyset [pw=pwgtp], sdr(pwgtp1 - pwgtp80) vce(sdr) mse

{txt}Sampling weights:{col 19}{res}pwgtp
             {txt}VCE:{col 19}{res}sdr
             {txt}MSE:{col 19}{res}on
{p2colset 1 19 19 2}{...}
{txt}{p2col:{space 5}SDR weights:}{res}pwgtp1 .. pwgtp80{p_end}
{p2colreset}{...}
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}<one>
 Sampling unit 1:{col 19}<observations>
           FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. di "Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion"
{res}Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion
{txt}
{com}. 
. di "White"
{res}White
{txt}
{com}. 
. svy sdr, subpop(if rac1p ==1 & charmeck == 1 & agep >=25 & agep <64 & esr !=4 & esr !=5) mse : tabulate esr, cell se ci deff
{res}{err}invalid subpop() option
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. svyset [pw=pwgtp], sdr(pwgtp1 - pwgtp80) vce(sdr) mse

{txt}Sampling weights:{col 19}{res}pwgtp
             {txt}VCE:{col 19}{res}sdr
             {txt}MSE:{col 19}{res}on
{p2colset 1 19 19 2}{...}
{txt}{p2col:{space 5}SDR weights:}{res}pwgtp1 .. pwgtp80{p_end}
{p2colreset}{...}
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}<one>
 Sampling unit 1:{col 19}<observations>
           FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
. local meck "puma == 3101 | puma == 3102 | puma == 3103 | puma == 3104 | puma == 3105 | puma == 3106 | puma == 3107 | puma == 3108"
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. gen charmeck = 0
{txt}
{com}. 
. replace charmeck = 1 if `meck'
{err}invalid syntax
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "C:\Users\mkhatun\AppData\Local\Temp\STD2514_000000.tmp"
{txt}
{com}. di "Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion"
{res}Labor Force Non-Participation for Black and White Population - use #6 in the categories for proportion
{txt}
{com}. 
. di "White"
{res}White
{txt}
{com}. 
. svy sdr, subpop(if rac1p ==1 & charmeck == 1 & agep >=25 & agep <64 & esr !=4 & esr !=5) mse : tabulate esr, cell se ci deff
{res}{err}no observations in subpop() subpopulation
subpop() = 1 indicates observation in subpopulation
subpop() = 0 indicates observation not in subpopulation
{txt}{search r(461), local:r(461);}

end of do-file

{search r(461), local:r(461);}

{com}. exit, clear
